[
  {
    "title": "Зачем нужен Angular.js и почему именно он",
    "summary": "В какой-то момент вы решаете написать веб-приложение, в котором абсолютно все работает на AJAX запросах",
    "content": "В какой-то момент вы решаете написать веб-приложение, в котором абсолютно все работает на AJAX запросах, страница никогда не перезагружается, а интерфейс напоминает полноценное настольное приложение, а не традиционный сайт. Вы попытаетесь сделать все при помощи простого JavaScript и пары десятков jQuery плагинов, и очень быстро написанный код станет невозможно поддерживать, невозможно читать и невозможно править.",
    "published": "True"
  },
  {
    "title": "ТЕКСТ НАУЧНОЙ РАБОТЫ",
    "summary": "В данной статье раскрывается такое понятие как WEB-разработка, а также процедура создания WEB-приложения или WEB-сайта.",
    "content": "Что же такое WEB-разработка, постараемся более подробно разобраться в данном вопросе.\\n\\nWEB-разработка (web development) - это процесс профессионального программирования сайта, который регулирует все последующие этапы, связанные с формированием HTML-кода, добавлением различных функциональных компонентов и скриптов, влияющих на показатели юзабилити и технической стабильности.",
    "published": "True"
  },
  {
    "title": "«Яндекс» научил «Алису» генерировать сказки при помощи нейросети",
    "summary": "И разговаривать шёпотом.",
    "content": "Голосовой помощник придумывает истории при помощи языковой модели из семейства YaLM, сообщила компания на презентации YaC 2021. Модель обучена на суперкомпьютерах «Яндекса», содержит 3 млрд параметров и может учиться на больших дата сетах.",
    "published": "True"
  },
  {
    "title": "Сделали приложение по распознаванию лиц и подтверждению личности",
    "summary": "Недавно мы в офисе снимали видео. Со стороны казалось, что человек в кадре делает селфи, но это было про AI. Наконец-то мы сделали коротенькую версию для соцсетей!",
    "content": "Приложение по распознаванию лиц и подтверждению личности на основе ИИ. Сканирование документов, подтверждение личности, проверка данных пользователя, проверка на мультиаккаунты и защита от подделки личности — всё в одном простом, юзер-френдли приложении от компании 'Технологика'.",
    "published": "True"
  },
  {
    "title": "Классификация текста с использованием моделей трансформеров",
    "summary": "Модели трансформеров на данный момент являются state-of-the-art решениями в мире обработки естественного языка. Новые, более крупные и качественные модели появляются почти каждый месяц, устанавливая новые критерии производительности по широкому кругу задач. В данной статье мы будем использовать модель трансформера для бинарной классификации текста.",
    "content": "Модели трансформеров на данный момент являются state-of-the-art решениями в мире обработки естественного языка. Новые, более крупные и качественные модели появляются почти каждый месяц, устанавливая новые критерии производительности по широкому кругу задач. В данной статье мы будем использовать модель трансформера для бинарной классификации текста. Для работы с текстом существует большое количество решений. Самая простая и популярная связка – TF-IDF + линейная модель. Данный подход позволяет обрабатывать и решать языковые задачи без особых затрат вычислительных ресурсов. Однако процесс использования такой связки требует дополнительных операций: чистка, лемматизация. В случае с BERT можно (даже нужно) опустить препроцессинг и сразу перейти к токенизации и обучению. Помимо дополнительных шагов, линейные модели часто выдают некорректные результат, так как не учитывают контекст слов. Понимание контекста является главным преимуществом трансформеров.",
    "published": "True"
  },
  {
    "title": "Статья 6",
    "summary": "Краткое описание",
    "content": "Сама статья... Очень большая статья!",
    "published": "True"
  },
  {
    "title": "Статья 7",
    "summary": "Краткое описание",
    "content": "Сама статья... Очень большая статья!",
    "published": "True"
  },
  {
    "title": "Статья 8",
    "summary": "Краткое описание",
    "content": "Сама статья... Очень большая статья!",
    "published": "True"
  },
  {
    "title": "Статья 9",
    "summary": "Краткое описание",
    "content": "Сама статья... Очень большая статья!",
    "published": "True"
  },
  {
    "title": "Статья 10",
    "summary": "Краткое описание",
    "content": "Сама статья... Очень большая статья!",
    "published": "True"
  },
  {
    "title": "Статья 11",
    "summary": "Краткое описание",
    "content": "Сама статья... Очень большая статья!",
    "published": "False"
  },
  {
    "title": "Статья 12",
    "summary": "Краткое описание",
    "content": "Сама статья... Очень большая статья!11",
    "published": "False"
  }
]